<a href="https://colab.research.google.com/github/MdShahadatHossainbd/ML/blob/master/One_Hot_Encoding_in_Python_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('Car model.csv')

In [4]:
df

   Car Model  Mileage  sell price($)   Age
0        BMW   100000          80000     7
1        BMW   100000          75000     6
2        BMW   200000         100000     8
3        BMW   300000         200000     8
4     TOYATA    40000           1000     5
5     TOYATA    50000           3000     4
6      TASLA   300000         120000    10
7      TASLA   400000         130000    12
8      TASLA   500000         140000    13
9      TASLA   400000         135000    11
10     TASLA   600000         150000    12
11     TASLA   700000         160000    15

In [5]:
dummies = pd.get_dummies(df['Car Model'])
dummies

    BMW  TASLA  TOYATA
0     1      0       0
1     1      0       0
2     1      0       0
3     1      0       0
4     0      0       1
5     0      0       1
6     0      1       0
7     0      1       0
8     0      1       0
9     0      1       0
10    0      1       0
11    0      1       0

In [6]:
dummies = pd.get_dummies(df['Mileage'])
dummies

    40000   50000   100000  200000  300000  400000  500000  600000  700000
0        0       0       1       0       0       0       0       0       0
1        0       0       1       0       0       0       0       0       0
2        0       0       0       1       0       0       0       0       0
3        0       0       0       0       1       0       0       0       0
4        1       0       0       0       0       0       0       0       0
5        0       1       0       0       0       0       0       0       0
6        0       0       0       0       1       0       0       0       0
7        0       0       0       0       0       1       0       0       0
8        0       0       0       0       0       0       1       0       0
9        0       0       0       0       0       1       0       0       0
10       0       0       0       0       0       0       0       1       0
11       0       0       0       0       0       0       0       0       1

In [7]:
merged = pd.concat([df,dummies],axis='columns')
merged

   Car Model  Mileage  sell price($)   Age  ...  400000  500000  600000  700000
0        BMW   100000          80000     7  ...       0       0       0       0
1        BMW   100000          75000     6  ...       0       0       0       0
2        BMW   200000         100000     8  ...       0       0       0       0
3        BMW   300000         200000     8  ...       0       0       0       0
4     TOYATA    40000           1000     5  ...       0       0       0       0
5     TOYATA    50000           3000     4  ...       0       0       0       0
6      TASLA   300000         120000    10  ...       0       0       0       0
7      TASLA   400000         130000    12  ...       1       0       0       0
8      TASLA   500000         140000    13  ...       0       1       0       0
9      TASLA   400000         135000    11  ...       1       0       0       0
10     TASLA   600000         150000    12  ...       0       0       1       0
11     TASLA   700000         160000    15  ...       0       0       0       1

[12 rows x 13 columns]

In [8]:
final = merged.drop(["Car Model"],axis='columns')
final

    Mileage  sell price($)   Age  40000  ...  400000  500000  600000  700000
0    100000          80000     7      0  ...       0       0       0       0
1    100000          75000     6      0  ...       0       0       0       0
2    200000         100000     8      0  ...       0       0       0       0
3    300000         200000     8      0  ...       0       0       0       0
4     40000           1000     5      1  ...       0       0       0       0
5     50000           3000     4      0  ...       0       0       0       0
6    300000         120000    10      0  ...       0       0       0       0
7    400000         130000    12      0  ...       1       0       0       0
8    500000         140000    13      0  ...       0       1       0       0
9    400000         135000    11      0  ...       1       0       0       0
10   600000         150000    12      0  ...       0       0       1       0
11   700000         160000    15      0  ...       0       0       0       1

[12 rows x 12 columns]

In [9]:
x = final.drop(['sell price($)'],axis=1)
y = df['sell price($)']

In [14]:
x

    Mileage   Age  40000  50000  100000  ...  300000  400000  500000  600000  700000
0    100000     7      0      0       1  ...       0       0       0       0       0
1    100000     6      0      0       1  ...       0       0       0       0       0
2    200000     8      0      0       0  ...       0       0       0       0       0
3    300000     8      0      0       0  ...       1       0       0       0       0
4     40000     5      1      0       0  ...       0       0       0       0       0
5     50000     4      0      1       0  ...       0       0       0       0       0
6    300000    10      0      0       0  ...       1       0       0       0       0
7    400000    12      0      0       0  ...       0       1       0       0       0
8    500000    13      0      0       0  ...       0       0       1       0       0
9    400000    11      0      0       0  ...       0       1       0       0       0
10   600000    12      0      0       0  ...       0       0       0       1       0
11   700000    15      0      0       0  ...       0       0       0       0       1

[12 rows x 11 columns]

In [15]:
y

0      80000
1      75000
2     100000
3     200000
4       1000
5       3000
6     120000
7     130000
8     140000
9     135000
10    150000
11    160000
Name: sell price($), dtype: int64

In [10]:
from sklearn.linear_model import LinearRegression #library
model = LinearRegression() #object

model.fit(x,y)

model.score(x,y)

0.9725184818454153

In [19]:
model.predict([[45000,3,11,0,0,0,0,0,0,0,0]])

array([-369321.01848791])

In [20]:
model.predict([[45000,11,1,0,0,0,0,0,0,0,0]])

array([-155895.42102345])

#SVM

In [23]:
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
model = SVC (gamma='auto')

model.fit(x,y)

model.score(x,y)

1.0

In [26]:
model.predict([[45000,3,11,0,0,0,0,0,0,0,0]])

array([200000])

#Random Forest Classifier

In [27]:
from sklearn.ensemble import RandomForestClassifier
Rclf = RandomForestClassifier()
model.fit(x,y)
model.score(x,y)

1.0

In [28]:
model.predict([[45000,3,11,0,0,0,0,0,0,0,0]])

array([200000])

#Decision Tree Classifier

In [29]:
from sklearn.tree import DecisionTreeClassifier
Clf = DecisionTreeClassifier()
model.fit(x,y)
model.score(x,y)

1.0

In [30]:
model.predict([[45000,3,11,0,0,0,0,0,0,0,0]])

array([200000])

In [33]:
model.predict([[450,5,1,0,0,0,0,0,0,0,0]])

array([200000])